In [3]:
import pandas as pd
import numpy as np

#### 1. 5의 배수로 구성된 수 9개를 생성해, Numpy Matrix 3x3 행렬로 만든 뒤, 첫 번째 행(Row)의 합과 평균을 구하는 함수를 생성하시오.
    - Matrix 는 아래와 같이 생성

![](https://data-station.notion.site/image/https%3A%2F%2Fprod-files-secure.s3.us-west-2.amazonaws.com%2F2a570022-4b51-46a3-9808-27bbed895639%2F7d86a521-9f28-46f4-b681-762c6a8aa4e0%2FUntitled.png?table=block&id=1ec0d872-fb06-4e26-8067-677672a556e7&spaceId=2a570022-4b51-46a3-9808-27bbed895639&width=290&userId=&cache=v2)

In [9]:
a = np.arange(5,46,5).reshape(3,3)
print(a[0].sum())
print(a[0].mean())

30
10.0

In [45]:
def npMatrix():
    a = np.arange(5,46,5).reshape(3,3)
    return a[0].sum(), a[0].mean()

npMatrix()

(30, 10.0)

#### 2. 두개의 값을 입력받아 두 값 사이의 10개의 데이터를 일정 간격으로 생성해 Vector(array)형태로 출력하는 함수를 생성하시오.

In [11]:
num1, num2 = int(input()), int(input())

np.linspace(num1, num2, 10)

8
5

array([8.        , 7.66666667, 7.33333333, 7.        , 6.66666667,
       6.33333333, 6.        , 5.66666667, 5.33333333, 5.        ])

In [48]:
def lin(num1,num2):
    return np.linspace(num1,num2, 10)

lin(7,5)

array([7.        , 6.77777778, 6.55555556, 6.33333333, 6.11111111,
       5.88888889, 5.66666667, 5.44444444, 5.22222222, 5.        ])

#### 3. 학생의 이름과 국어점수, 수학점수, 영어점수를 입력받아 Pandas DataFrame형태로 구성하는 함수를 생성하시오.

In [22]:
name = input('이름 : ')
korean = int(input('국어점수 : '))
math = int(input("수학점수 : "))
english = int(input('영어점수 : '))

df = pd.DataFrame({'이름':[name],
            '국어': [korean],
            '수학': [math],
            '영어':[english]})

df

이름 : 홍
국어점수 : 40
수학점수 : 30
영어점수 : 49

  이름  국어  수학  영어
0  홍  40  30  49

In [49]:
def student(name, korean, math, english):
    df = pd.DataFrame({'이름':[name],
            '국어': [korean],
            '수학': [math],
            '영어':[english]})
    return df

student('홍', 84,43,46)

  이름  국어  수학  영어
0  홍  84  43  46

In [6]:
def make_students_list():
    total = []
    
    n = int(input("학생 수 : "))
    
    for i in range(n):
        name = input("이름 : ")
        score1 = input("국어점수 : ")
        score2 = input("수학점수 : ")
        score3 = input("영어점수 : ")
        total.append([name, score1, score2, score3])
    return pd.DataFrame(total, columns=['이름','국어','수학','영어'])
""
make_students_list()

학생 수 : 3
이름 : 홍길
국어점수 : 80
수학점수 : 40
영어점수 : 90
이름 : 길동
국어점수 : 30
수학점수 : 45
영어점수 : 68
이름 : 동홍
국어점수 : 30
수학점수 : 70
영어점수 : 96

   이름  국어  수학  영어
0  홍길  80  40  90
1  길동  30  45  68
2  동홍  30  70  96

#### 4. 02_Data.csv를 불러와 df1으로 선언하고, 데이터의 구조와 타입을 확인하시오.

In [7]:
df1 = pd.read_csv("실습 파일/02_Data.csv")
df1.head(2)

,Index,Member_ID,Sales_Type,Contract_Type,Channel,Datetime,Term,Payment_Type,Product_Type,Amount_Month,Customer_Type,Age,Address1,Address2,State,Overdue_count,Overdue_Type,Gender,Credit_Rank,Bank
0,1,66758234,렌탈,일반계약,영업방판,2022-05-05,60,CMS,DES-1,96900,개인,42.0,경기도,경기도,계약확정,0,없음,여자,9.0,새마을금고
1,2,66755948,렌탈,교체계약,영업방판,2023-02-19,60,카드이체,DES-1,102900,개인,39.0,경기도,경기도,계약확정,0,없음,남자,2.0,현대카드

In [21]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 51301 entries, 0 to 51300
Data columns (total 20 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Index          51301 non-null  int64
 1   Member_ID      51301 non-null  int64
 2   Sales_Type     51301 non-null  object
 3   Contract_Type  51301 non-null  object
 4   Channel        51301 non-null  object
 5   Datetime       51301 non-null  object
 6   Term           51301 non-null  int64
 7   Payment_Type   51301 non-null  object
 8   Product_Type   51301 non-null  object
 9   Amount_Month   51301 non-null  int64
 10  Customer_Type  51299 non-null  object
 11  Age            44329 non-null  float64
 12  Address1       51299 non-null  object
 13  Address2       51299 non-null  object
 14  State          51301 non-null  object
 15  Overdue_count  51301 non-null  int64
 16  Overdue_Type   51301 non-null  object
 17  Gender         51301 non-null  object
 18  Credit_Rank    42520 non-null  float64
 19  Bank           48542 non-null  object
dtypes: float64(2), int64(5), object(13)
memory usage: 7.8+ MB

#### 5. 해당 데이터 고객 계약명단에서 우수고객들을 찾고자 한다. df1 데이터에서 월랜탈비용('Amount_Month)이 높고, 연체건수('Overdue_count')는 낮은 상위 50명의 고객 계약 명단을 추출해서, result2.xlsx 로 저장하시오.

In [8]:
df2 = df1.sort_values(['Amount_Month','Overdue_count'], ascending = [False, True]).head(50)
df2.to_excel("실습 파일/result2.xlsx", index=False)

#### 6. 젊은 고객들을 대상으로 마케팅 전략을 수립하기위해, 데이터를 추출하고자 한다.연령이(Age)이 낮은 100명의 계약명단을 추출하여, df1_young 변수로 선언하고, 데이터의 구조와 타입을 확인하시오.

In [32]:
df1_young = df1.sort_values('Age').head(100)
df1_young.info()

<class 'pandas.core.frame.DataFrame'>
Index: 100 entries, 46706 to 5846
Data columns (total 20 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Index          100 non-null    int64
 1   Member_ID      100 non-null    int64
 2   Sales_Type     100 non-null    object
 3   Contract_Type  100 non-null    object
 4   Channel        100 non-null    object
 5   Datetime       100 non-null    object
 6   Term           100 non-null    int64
 7   Payment_Type   100 non-null    object
 8   Product_Type   100 non-null    object
 9   Amount_Month   100 non-null    int64
 10  Customer_Type  100 non-null    object
 11  Age            100 non-null    float64
 12  Address1       100 non-null    object
 13  Address2       100 non-null    object
 14  State          100 non-null    object
 15  Overdue_count  100 non-null    int64
 16  Overdue_Type   100 non-null    object
 17  Gender         100 non-null    object
 18  Credit_Rank    88 non-null     float64
 19  Bank           100 non-null    object
dtypes: float64(2), int64(5), object(13)
memory usage: 16.4+ KB

#### 7. df1_young데이터와 df1데이터에서 월랜탈비용('Amount_Month')의 평균을 계산하고, 두 값의 차이를 계산하시오.

In [34]:
young = df1_young['Amount_Month'].mean()
total = df1['Amount_Month'].mean()

print(abs(total-young))

196.02571099979104

#### 8. df1_young데이터에서 월랜탈비용('Amount_Month')이 높고 연체건수('Overdue_count')가 낮은 순서대로 정렬하여 result_young.xlsx로 저장하시오.

In [35]:
result2 = df1_young.sort_values(['Amount_Month', 'Overdue_count'], ascending=[False, True])
result2.to_excel("실습 파일/result_young.xlsx", index=False)

#### 9. 본사에서 매출관리를 위해 연체가 높은 고객들을 따로 확인하여 관리하고자 한다. 연체건수('Overdue_count')가 높은 순서대로 정렬하고, 상위 100명의 고객의 연령('Age')의 최대값과 최솟값을 확인하고, 신용등급('Credit_Rank')의 평균을 확인하시오.

In [44]:
overdue_person = df1.sort_values("Overdue_count", ascending=False).head(100)
print('연령 최대값:',overdue_person['Age'].max())
print('연령 최소값:',overdue_person['Age'].min())
print('신용등급 평균:',overdue_person['Credit_Rank'].mean())

연령 최대값: 85.0
연령 최소값: 26.0
신용등급 평균: 6.945205479452055

#### 10. 매출 관리 부서의 A씨는 매주 해당 데이터를 받아 계약 금액이 높은 1000개의 계약 명단의 평균 값을 계산한다고 한다. 이 업무를 자동화 하기 위해, 데이터를 입력했을 때, 월랜탈비용('Amount_Month')가 높은 1000개의 데이터를 추출하여, 해당 데이터의 월랜탈비용('Amount_Month')평균을 계산하는 함수를 만드시오.

In [41]:
def auto_Amount(df):
    df = df.sort_values('Amount_Month', ascending=False).head(1000)
    return df.Amount_Month.mean()

auto_Amount(df1)

144188.25